particle-iot/device-os/platform/MCU/nRF52840/src/flash_mal.c
static bool parse_compressed_module_header(flash_device_t dev, uintptr_t addr, size_t size, compressed_module_header* header) {
    if (size < sizeof(module_info_t) + sizeof(compressed_module_header)) {
        return false;
    }
    if (!flash_read(dev, addr + sizeof(module_info_t), (uint8_t*)header, sizeof(compressed_module_header))) {
        return false;
    }
    if (header->size > sizeof(compressed_module_header) && size < sizeof(module_info_t) + header->size) {
        return false;
    }
    if (header->method != 0) { // Raw Deflate
        return false;
    }
    return true;
}

#endif // HAS_COMPRESSED_OTA

#if HAS_DELTA_UPDATES

// Context structure for the callbacks used by inflate_create() and bspatch()
typedef struct {
    uint8_t comp_buf[COPY_BLOCK_SIZE];
    uint8_t decomp_buf[COPY_BLOCK_SIZE];
    inflate_ctx* inflate;
    flash_device_t src_dev;
    flash_device_t dest_dev;
    flash_device_t patch_dev;
    uintptr_t src_addr;
    uintptr_t src_start_addr;
    uintptr_t src_end_addr;
    uintptr_t dest_addr;
    uintptr_t dest_end_addr;
    uintptr_t patch_addr;
    uintptr_t patch_end_addr;
    size_t comp_read_offs;
    size_t comp_write_offs;
    size_t decomp_read_offs;
    size_t decomp_write_offs;
    bool has_more_output;
} flash_patch_ctx;

static int flash_patch_src_seek(ssize_t offs, void* user_data) {
    flash_patch_ctx* const ctx = (flash_patch_ctx*)user_data;
    const intptr_t src_addr = (intptr_t)ctx->src_addr + offs;
    if (src_addr < (intptr_t)ctx->src_start_addr || src_addr > (intptr_t)ctx->src_end_addr) {
        return -1;
    }
    ctx->src_addr = src_addr;
    return 0;
}

static int flash_patch_src_read(char* data, size_t size, void* user_data) {
    flash_patch_ctx* const ctx = (flash_patch_ctx*)user_data;
    if (ctx->src_addr + size > ctx->src_end_addr) {
        return -1;
    }
    const bool ok = flash_read(ctx->src_dev, ctx->src_addr, data, size);
    if (!ok) {
        return -1;
    }
    ctx->src_addr += size;
    return size;
}

static int flash_patch_dest_write(const char* data, size_t size, void* user_data) {
    flash_patch_ctx* const ctx = (flash_patch_ctx*)user_data;
    if (ctx->dest_addr + size > ctx->dest_end_addr) {
        return -1;
    }
    const bool ok = flash_write(ctx->dest_dev, ctx->dest_addr, data, size);
    if (!ok) {
        return -1;
    }
    ctx->dest_addr += size;
    return size;
}

static int flash_patch_read(char* data, size_t size, void* user_data) {
    flash_patch_ctx* const ctx = (flash_patch_ctx*)user_data;
    size_t bytes_to_read = size;
    while (bytes_to_read > 0) {
        if (ctx->decomp_read_offs < ctx->decomp_write_offs) {
            // Read decompressed patch data
            size_t n = ctx->decomp_write_offs - ctx->decomp_read_offs;
            if (n > bytes_to_read) {
                n = bytes_to_read;
            }
            memcpy(data, ctx->decomp_buf + ctx->decomp_read_offs, n);
            data += n;
            ctx->decomp_read_offs += n;
            if (ctx->decomp_read_offs == ctx->decomp_write_offs) {
                ctx->decomp_read_offs = 0;
                ctx->decomp_write_offs = 0;
            }
            bytes_to_read -= n;
        } else if (ctx->has_more_output || ctx->comp_read_offs < ctx->comp_write_offs) {
            // Decompress patch data
            size_t n = ctx->comp_write_offs - ctx->comp_read_offs;
            unsigned flags = 0;
            if (ctx->patch_addr < ctx->patch_end_addr) {
                flags |= INFLATE_HAS_MORE_INPUT;
            }
            const int r = inflate_input(ctx->inflate, ctx->comp_buf + ctx->comp_read_offs, &n, flags);
            if (r < 0) {
                return -1;
            }
            ctx->has_more_output = (r == INFLATE_HAS_MORE_OUTPUT);
            ctx->comp_read_offs += n;
            if (ctx->comp_read_offs > ctx->comp_write_offs) { // Sanity check
                return -1;
            }
            if (ctx->comp_read_offs == ctx->comp_write_offs) {
                ctx->comp_read_offs = 0;
                ctx->comp_write_offs = 0;
            }
        } else if (ctx->patch_addr < ctx->patch_end_addr && ctx->comp_write_offs < sizeof(ctx->comp_buf)) {
            // Read compressed patch data
            size_t n = ctx->patch_end_addr - ctx->patch_addr;
            if (n > sizeof(ctx->comp_buf) - ctx->comp_write_offs) {
                n = sizeof(ctx->comp_buf) - ctx->comp_write_offs;
            }
            const bool ok = flash_read(ctx->patch_dev, ctx->patch_addr, ctx->comp_buf + ctx->comp_write_offs, n);
            if (!ok) {
                return -1;
            }
            ctx->comp_write_offs += n;
            ctx->patch_addr += n;
        } else {
            return -1; // No bytes left but bspatch() still wants us to read some
        }
    }
    return size;
}

static int flash_patch_inflate_output(const char* data, size_t size, void* user_data) {
    flash_patch_ctx* const ctx = (flash_patch_ctx*)user_data;
    size_t n = sizeof(ctx->decomp_buf) - ctx->decomp_write_offs;
    if (n > size) {
        n = size;
    }
    memcpy(ctx->decomp_buf + ctx->decomp_write_offs, data, n);
    ctx->decomp_write_offs += n;
    return n;
}

static bool flash_patch(flash_device_t src_dev, uintptr_t src_addr, size_t src_size, flash_device_t dest_dev,
        uintptr_t dest_addr, size_t dest_size, flash_device_t patch_dev, uintptr_t patch_addr, size_t patch_size) {
    flash_patch_ctx ctx = { 0 };
    ctx.src_dev = src_dev;
    ctx.src_addr = src_addr;
    ctx.src_start_addr = src_addr;
    ctx.src_end_addr = src_addr + src_size;
    ctx.dest_dev = dest_dev;
    ctx.dest_addr = dest_addr;
    ctx.dest_end_addr = dest_addr + dest_size;
    ctx.patch_dev = patch_dev;
    ctx.patch_addr = patch_addr;
    ctx.patch_end_addr = patch_addr + patch_size;
    ctx.comp_read_offs = 0;
    ctx.comp_write_offs = 0;
    ctx.decomp_read_offs = 0;
    ctx.decomp_write_offs = 0;
    ctx.has_more_output = false;
    int r = inflate_create(&ctx.inflate, NULL /* opts */, flash_patch_inflate_output, &ctx);
    if (r < 0) {
        goto error;
    }
    r = bspatch(flash_patch_read, flash_patch_src_read, flash_patch_src_seek, flash_patch_dest_write, dest_size, &ctx);
    if (r < 0) {
        goto error;
    }
    inflate_destroy(ctx.inflate);
    return true;
error:
    inflate_destroy(ctx.inflate);
    return false;
}

static bool parse_delta_update_module_header(flash_device_t dev, uintptr_t addr, size_t size,
        delta_update_module_header* header) {
    if (size < sizeof(module_info_t) + sizeof(delta_update_module_header)) {
        return false;
    }
    if (!flash_read(dev, addr + sizeof(module_info_t), (uint8_t*)header, sizeof(delta_update_module_header))) {
        return false;
    }
    if (header->size > sizeof(delta_update_module_header) && size < sizeof(module_info_t) + header->size) {
        return false;
    }
    if (header->format != 0) { // ENDSLEY/BSDIFF43 compressed with raw Deflate
        return false;
    }
    return true;
}

#endif // HAS_DELTA_UPDATES

