particle-iot/device-os/platform/MCU/nRF52840/src/flash_mal.c
bool FLASH_CheckValidAddressRange(flash_device_t flashDeviceID, uint32_t startAddress, uint32_t length)
{
    // FIXME: remove magic numbers
    uint32_t endAddress = startAddress + length - 1;

    if (flashDeviceID == FLASH_INTERNAL)
    {
        return (startAddress >= 0x00000000 && endAddress <= 0x100000) ||
               (startAddress >= 0x12000000 && endAddress <= 0x20000000);
    }
    else if (flashDeviceID == FLASH_SERIAL)
    {
#ifdef USE_SERIAL_FLASH
        return startAddress >= 0x00000000 && endAddress <= EXTERNAL_FLASH_SIZE;
#else
        return false;
#endif
    }
    else
    {
        return false;   //Invalid FLASH ID
    }

    return true;
}

bool FLASH_EraseMemory(flash_device_t flashDeviceID, uint32_t startAddress, uint32_t length)
{
    uint32_t numSectors;

    if (FLASH_CheckValidAddressRange(flashDeviceID, startAddress, length) != true)
    {
        return false;
    }

    if (flashDeviceID == FLASH_INTERNAL)
    {
        numSectors = CEIL_DIV(length, INTERNAL_FLASH_PAGE_SIZE);

        if (hal_flash_erase_sector(startAddress, numSectors) != 0)
        {
            return false;
        }

        return true;
    }
#ifdef USE_SERIAL_FLASH
    else if (flashDeviceID == FLASH_SERIAL)
    {
        numSectors = CEIL_DIV(length, sFLASH_PAGESIZE);

        if (hal_exflash_erase_sector(startAddress, numSectors) != 0)
        {
            return false;
        }

        return true;
    }
#endif

    return false;
}

int FLASH_CheckCopyMemory(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                      flash_device_t destinationDeviceID, uint32_t destinationAddress,
                      uint32_t length, uint8_t module_function, uint8_t flags)
{
    size_t dest_size = length;
    if (flags & MODULE_DELTA_UPDATE) {
#if HAS_DELTA_UPDATES
        delta_update_module_header header = { 0 };
        if (!parse_delta_update_module_header(sourceDeviceID, sourceAddress, length, &header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = header.dest_size;
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_DELTA_UPDATES
    } else if (flags & MODULE_COMPRESSED) {
#if HAS_COMPRESSED_OTA
        compressed_module_header header = { 0 };
        if (!parse_compressed_module_header(sourceDeviceID, sourceAddress, length, &header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = header.original_size;
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_COMPRESSED_OTA
    }
    if (!verify_module(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size,
            module_function, flags)) {
        return FLASH_ACCESS_RESULT_BADARG;
    }
    return FLASH_ACCESS_RESULT_OK;
}

int FLASH_CopyMemory(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                     flash_device_t destinationDeviceID, uint32_t destinationAddress,
                     uint32_t length, uint8_t module_function, uint8_t flags)
{
    size_t dest_size = length;
    // TODO: It's time to split this function into a few functions that would separately handle a
    // regular update, compressed update, delta update or bootloader update
#if HAS_DELTA_UPDATES
    delta_update_module_header delta_header = { 0 };
    if (flags & MODULE_DELTA_UPDATE) {
        if (!parse_delta_update_module_header(sourceDeviceID, sourceAddress, length, &delta_header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = delta_header.dest_size;
    }
#endif // HAS_DELTA_UPDATES
#if HAS_COMPRESSED_OTA
    compressed_module_header comp_header = { 0 };
    if ((flags & MODULE_COMPRESSED) && !(flags & MODULE_DELTA_UPDATE)) {
        if (!parse_compressed_module_header(sourceDeviceID, sourceAddress, length, &comp_header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = comp_header.original_size;
    }
#endif // HAS_COMPRESSED_OTA
    if (!verify_module(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size,
            module_function, flags)) {
        return FLASH_ACCESS_RESULT_BADARG;
    }
#if SOFTDEVICE_MBR_UPDATES
    if (module_function == MODULE_FUNCTION_BOOTLOADER && destinationAddress == USER_FIRMWARE_IMAGE_LOCATION) {
        // Backup user firmware
        dest_size = CEIL_DIV(length, INTERNAL_FLASH_PAGE_SIZE) * INTERNAL_FLASH_PAGE_SIZE;
        if (!FLASH_EraseMemory(FLASH_SERIAL, EXTERNAL_FLASH_RESERVED_ADDRESS, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (!flash_copy(FLASH_INTERNAL, USER_FIRMWARE_IMAGE_LOCATION, FLASH_SERIAL, EXTERNAL_FLASH_RESERVED_ADDRESS, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        // Add backed up partial user firmware to slots, so that it's restored on next boot
        if (!FLASH_AddToNextAvailableModulesSlot(FLASH_SERIAL, EXTERNAL_FLASH_RESERVED_ADDRESS, FLASH_INTERNAL,
                USER_FIRMWARE_IMAGE_LOCATION, dest_size, MODULE_FUNCTION_NONE, 0)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
    }
#endif // SOFTDEVICE_MBR_UPDATES
    // Do not erase the destination storage now if we're applying a delta update
    if (!(flags & MODULE_DELTA_UPDATE) && !FLASH_EraseMemory(destinationDeviceID, destinationAddress, dest_size)) {
        return FLASH_ACCESS_RESULT_ERROR;
    }
    if (flags & MODULE_DELTA_UPDATE) {
#if HAS_DELTA_UPDATES
        // In the context of delta updates, the source data is the module data that is already
        // flashed on the device
        const flash_device_t src_dev = destinationDeviceID;
        const uintptr_t src_addr = destinationAddress;
        const size_t src_size = delta_header.src_size;
        // Patch data is what is contained in the downloaded module that we need to apply
        const flash_device_t patch_dev = sourceDeviceID;
        uintptr_t patch_addr = sourceAddress;
        size_t patch_size = length;
        // Skip the module info and delta update headers
        if (patch_size < sizeof(module_info_t) + delta_header.size + 2 /* Suffix size */ + 4 /* CRC-32 */) { // Sanity check
            return FLASH_ACCESS_RESULT_BADARG;
        }
        patch_addr += sizeof(module_info_t) + delta_header.size;
        patch_size -= sizeof(module_info_t) + delta_header.size + 4 /* CRC-32 */;
        // Determine where the patch data ends
        uint16_t suffix_size = 0;
        if (!flash_read(patch_dev, patch_addr + patch_size - 2, (uint8_t*)&suffix_size, 2)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (patch_size < suffix_size) {
            return FLASH_ACCESS_RESULT_BADARG;
        }
        patch_size -= suffix_size;
        // FIXME: Temporarily store the patched binary at the very end of the OTA section
        const flash_device_t dest_dev = FLASH_SERIAL;
        uintptr_t dest_addr = EXTERNAL_FLASH_OTA_ADDRESS + (EXTERNAL_FLASH_OTA_LENGTH / sFLASH_PAGESIZE * sFLASH_PAGESIZE) -
                ((dest_size + sFLASH_PAGESIZE - 1) / sFLASH_PAGESIZE * sFLASH_PAGESIZE);
        if (!FLASH_EraseMemory(dest_dev, dest_addr, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        // Apply the patch
        if (!flash_patch(src_dev, src_addr, src_size, dest_dev, dest_addr, dest_size, patch_dev, patch_addr, patch_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        // Overwrite the "source" module with the patched module
        if (!FLASH_EraseMemory(src_dev, src_addr, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (!flash_copy(dest_dev, dest_addr, src_dev, src_addr, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_DELTA_UPDATES
    } else if (flags & MODULE_COMPRESSED) {
#if HAS_COMPRESSED_OTA
        // Skip the module info and compressed data headers
        if (length < sizeof(module_info_t) + comp_header.size + 2 /* Suffix size */ + 4 /* CRC-32 */) { // Sanity check
            return FLASH_ACCESS_RESULT_BADARG;
        }
        sourceAddress += sizeof(module_info_t) + comp_header.size;
        length -= sizeof(module_info_t) + comp_header.size + 4;
        // Determine where the compressed data ends
        uint16_t suffix_size = 0;
        if (!flash_read(sourceDeviceID, sourceAddress + length - 2, (uint8_t*)&suffix_size, 2)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (length < suffix_size) {
            return FLASH_ACCESS_RESULT_BADARG;
        }
        length -= suffix_size;
        if (!flash_decompress(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_COMPRESSED_OTA
    } else {
        // XXX: Device OS versions < 2.0.0 may not be setting this flag in the module slots!
        // Bootloader should rely on the actual flags within the module header!
        if (!(flags & MODULE_DROP_MODULE_INFO) && (flags & MODULE_VERIFY_MASK)) {
            // We may only check the module header if we've been asked to verify it
            uint32_t infoOffset = 0;
            const module_info_t* info = FLASH_ModuleInfo(sourceDeviceID, sourceAddress, &infoOffset);
            if (info->flags & MODULE_INFO_FLAG_DROP_MODULE_INFO) {
                // NB: We have corner cases where the module info is not located in the
                // front of the module but for example after the vector table and we
                // only want to enable this feature in the case it is in the front,
                // hence the module_info_t located at the the source address check.
                if (infoOffset == 0) {
                    // Skip module header
                    flags |= MODULE_DROP_MODULE_INFO;
                } else {
                    return FLASH_ACCESS_RESULT_ERROR;
                }
            }
        }
        if (flags & MODULE_DROP_MODULE_INFO) {
            // Skip the module info header
            if (length < sizeof(module_info_t)) { // Sanity check
                return FLASH_ACCESS_RESULT_BADARG;
            }
            sourceAddress += sizeof(module_info_t);
            length -= sizeof(module_info_t);
        }
        if (!flash_copy(sourceDeviceID, sourceAddress, destinationDeviceID, destinationAddress, length)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
    }

#if SOFTDEVICE_MBR_UPDATES
    if (module_function == MODULE_FUNCTION_BOOTLOADER && destinationAddress == USER_FIRMWARE_IMAGE_LOCATION) {
        sd_mbr_command_t command = {
            .command = SD_MBR_COMMAND_COPY_BL,
            .params.copy_bl.bl_src = (uint32_t*)destinationAddress,
            // length is in words!
            .params.copy_bl.bl_len = CEIL_DIV(length, 4)
        };

        uint32_t mbr_result = sd_mbr_command(&command);
        if (!mbr_result) {
            // We are anyway returning reset pending state here
            // in order for the bootloader to immediately reset and restore the
            // application module.
            return FLASH_ACCESS_RESULT_RESET_PENDING;
        }
        // We will not reach this point actually, as MBR will reset automatically
        return FLASH_ACCESS_RESULT_RESET_PENDING;
    }
#endif // SOFTDEVICE_MBR_UPDATES
    return FLASH_ACCESS_RESULT_OK;
}

